# CannotOffsetBoundary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotOffsetBoundary Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't create Boundary as an offset of Run Curve
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotOffsetBoundary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotOffsetBoundary As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotOffsetBoundary {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace